VarCfg = {}

------------------------------------------------------------------------------------------------------------------------全局自定义变量
--- @field castleDonateRank string 服务器名
--VarCfg.castleDonateRank = "castleDonateRank"
------------------------------------------------------------------------------------------------------------------------个人自定义变量


------------------------------------------------------------------------------------------------------------------------A变量 string类型 系统变量
VarCfg["全服首爆"] = "A10"
VarCfg["全服首杀"] = "A11"

VarCfg["开服标记"] = "A100"

------------------------------------------------------------------------------------------------------------------------G变量 number类型 系统变量
VarCfg["开区时间戳"] = "G70"
VarCfg["开区时间"] = "G10"

VarCfg["合区次数"] = "G99"
VarCfg["开区天数"] = "G100"

VarCfg["总捐献金额"] = "G71"
VarCfg["沙奖励开放标记"] = "G72"

------------------------------------------------------------------------------------------------------------------------T变量 string类型 永久人物变量
VarCfg["综合属性"] = "T2"
VarCfg["装备回收"] = "T3"

VarCfg["探索者称号点亮装备"] = "T4"
VarCfg["临时契约术怪物"] = "T5"
VarCfg["是否永久"] = "T6"
VarCfg["地图激活"] = "T7"
VarCfg["累充会员领取状态"] = "T8"
VarCfg["赞助领取状态"] = "T9"
VarCfg["副本通关记录"] = "T10"

------------------------------------------------------------------------------------------------------------------------U变量 number类型 永久人物变量
VarCfg["总登录天数"] = "U1"
VarCfg["我的总在线时间"] = "U3"
VarCfg["地图等级"] = "U4"
VarCfg["最大地图等级"] = "U5"

VarCfg["角色职业"] = "U6"

VarCfg["生肖装备开孔数量"] = "U7"

VarCfg["探索者称号"] = "U8"
VarCfg["在线仓库"] = "U9"
VarCfg["在线回收"] = "U10"

VarCfg["副本等级"] = "U11"

VarCfg["装备复活时间戳"] = "U19"
VarCfg["鬼爪复活时间戳"] = "U20"

VarCfg["顶级赞助"] = "U24"
VarCfg["自动回收"] = "U25"
VarCfg["自动吃货币"] = "U26"

------------------------------------------------------------------------------------------------------------------------J变量 number类型 天变量
VarCfg["我的在线时间"] = "J5"
VarCfg["封神塔挑战次数"] = "J6"
------------------------------------------------------------------------------------------------------------------------N变量 number类型 下线不保存
VarCfg["亡灵大军数量"] = "N7"
VarCfg["死灵大法数量"] = "N8"
VarCfg["爆炸蛊虫数量"] = "N9"
VarCfg["献祭蛊虫数量"] = "N10"
VarCfg["虫王数量"] = "N11"


------------------------------------------------------------------------------------------------------------------------Z变量 string类型 天变量
--- @field Z100 string 在线礼包领取json
--VarCfg.dayOnlineGiftFlagJson = "Z100"



------------------------------------------------------------------------------------------------------------------------个人标识



------------------------------------------------------------------------------------------------------------------------N$临时自定义变量
--VarCfg["清明值"] = "N$清明值"
return VarCfg
